tests/env01/system/probes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writes out values of fields from cells nearest to specified locations.

\*---------------------------------------------------------------------------*/

#includeEtc "caseDicts/postProcessing/probes/probes.cfg"

fields (p U);
probeLocations
(
    (0.075 0 0)
    (0.073860581 0.013023613 0)
    (0.070476947 0.025651511 0)
    (0.064951905 0.0375 0)
    (0.057453333 0.048209071 0)
    (0.048209071 0.057453333 0)
    (0.0375 0.064951905 0)
    (0.025651511 0.070476947 0)
    (0.013023613 0.073860581 0)
    (0 0.075 0)
    (-0.013023613 0.073860581 0)
    (-0.025651511 0.070476947 0)
    (-0.0375 0.064951905 0)
    (-0.048209071 0.057453333 0)
    (-0.057453333 0.048209071 0)
    (-0.064951905 0.0375 0)
    (-0.070476947 0.025651511 0)
    (-0.073860581 0.013023613 0)
    (-0.075 0 0)
    (-0.073860581 -0.013023613 0)
    (-0.070476947 -0.025651511 0)
    (-0.064951905 -0.0375 0)
    (-0.057453333 -0.048209071 0)
    (-0.048209071 -0.057453333 0)
    (-0.0375 -0.064951905 0)
    (-0.025651511 -0.070476947 0)
    (-0.013023613 -0.073860581 0)
    (0 -0.075 0)
    (0.013023613 -0.073860581 0)
    (0.025651511 -0.070476947 0)
    (0.0375 -0.064951905 0)
    (0.048209071 -0.057453333 0)
    (0.057453333 -0.048209071 0)
    (0.064951905 -0.0375 0)
    (0.070476947 -0.025651511 0)
    (0.073860581 -0.013023613 0)
    (0.1 0 0)
    (0.098480775 0.017364818 0)
    (0.093969262 0.034202014 0)
    (0.08660254 0.05 0)
    (0.076604444 0.064278761 0)
    (0.064278761 0.076604444 0)
    (0.05 0.08660254 0)
    (0.034202014 0.093969262 0)
    (0.017364818 0.098480775 0)
    (0 0.1 0)
    (-0.017364818 0.098480775 0)
    (-0.034202014 0.093969262 0)
    (-0.05 0.08660254 0)
    (-0.064278761 0.076604444 0)
    (-0.076604444 0.064278761 0)
    (-0.08660254 0.05 0)
    (-0.093969262 0.034202014 0)
    (-0.098480775 0.017364818 0)
    (-0.1 0 0)
    (-0.098480775 -0.017364818 0)
    (-0.093969262 -0.034202014 0)
    (-0.08660254 -0.05 0)
    (-0.076604444 -0.064278761 0)
    (-0.064278761 -0.076604444 0)
    (-0.05 -0.08660254 0)
    (-0.034202014 -0.093969262 0)
    (-0.017364818 -0.098480775 0)
    (0 -0.1 0)
    (0.017364818 -0.098480775 0)
    (0.034202014 -0.093969262 0)
    (0.05 -0.08660254 0)
    (0.064278761 -0.076604444 0)
    (0.076604444 -0.064278761 0)
    (0.08660254 -0.05 0)
    (0.093969262 -0.034202014 0)
    (0.098480775 -0.017364818 0)
    (-0.025 -0.15 0)
    (0 -0.15 0)
    (0.025 -0.15 0)
    (0.05 -0.15 0)
    (0.075 -0.15 0)
    (0.1 -0.15 0)
    (-0.025 -0.1 0)
    (0 -0.1 0)
    (0.025 -0.1 0)
    (0.05 -0.1 0)
    (0.075 -0.1 0)
    (0.1 -0.1 0)
    (0.075 -0.05 0)
    (0.1 -0.05 0)
    (0.075 0 0)
    (0.1 0 0)
    (0.075 0.05 0)
    (0.1 0.05 0)
    (-0.025 0.1 0)
    (0 0.1 0)
    (0.025 0.1 0)
    (0.05 0.1 0)
    (0.075 0.1 0)
    (0.1 0.1 0)
    (-0.025 0.15 0)
    (0 0.15 0)
    (0.025 0.15 0)
    (0.05 0.15 0)
    (0.075 0.15 0)
    (0.1 0.15 0)
    (0.15 -0.15 0)
    (0.2 -0.15 0)
    (0.25 -0.15 0)
    (0.3 -0.15 0)
    (0.35 -0.15 0)
    (0.4 -0.15 0)
    (0.45 -0.15 0)
    (0.15 -0.1 0)
    (0.2 -0.1 0)
    (0.25 -0.1 0)
    (0.3 -0.1 0)
    (0.35 -0.1 0)
    (0.4 -0.1 0)
    (0.45 -0.1 0)
    (0.15 -0.05 0)
    (0.2 -0.05 0)
    (0.25 -0.05 0)
    (0.3 -0.05 0)
    (0.35 -0.05 0)
    (0.4 -0.05 0)
    (0.45 -0.05 0)
    (0.15 0 0)
    (0.2 0 0)
    (0.25 0 0)
    (0.3 0 0)
    (0.35 0 0)
    (0.4 0 0)
    (0.45 0 0)
    (0.15 0.05 0)
    (0.2 0.05 0)
    (0.25 0.05 0)
    (0.3 0.05 0)
    (0.35 0.05 0)
    (0.4 0.05 0)
    (0.45 0.05 0)
    (0.15 0.1 0)
    (0.2 0.1 0)
    (0.25 0.1 0)
    (0.3 0.1 0)
    (0.35 0.1 0)
    (0.4 0.1 0)
    (0.45 0.1 0)
    (0.15 0.15 0)
    (0.2 0.15 0)
    (0.25 0.15 0)
    (0.3 0.15 0)
    (0.35 0.15 0)
    (0.4 0.15 0)
    (0.45 0.15 0)
);

